In [1]:
import pandas as pd
import numpy as np

In [2]:
url = 'https://github.com/HamoyeHQ/HDSC-Introduction-to-Python-for-machine-learning/files/7768140/FoodBalanceSheets_E_Africa_NOFLAG.csv'
data = pd.read_csv(url, encoding='latin-1')

In [3]:
data

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.00,39728.00,40551.00,41389.00,42228.00
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.00,0.00,0.00,0.00,0.00
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.00,3379.00,3372.00,3341.00,3322.00
3,4,Algeria,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,94.90,94.35,94.72,92.82,91.83
4,4,Algeria,2901,Grand Total,684,Fat supply quantity (g/capita/day),g/capita/day,80.06,79.36,77.40,80.19,77.28
...,...,...,...,...,...,...,...,...,...,...,...,...
60938,181,Zimbabwe,2899,Miscellaneous,5142,Food,1000 tonnes,42.00,46.00,33.00,19.00,16.00
60939,181,Zimbabwe,2899,Miscellaneous,645,Food supply quantity (kg/capita/yr),kg,3.06,3.33,2.35,1.33,1.08
60940,181,Zimbabwe,2899,Miscellaneous,664,Food supply (kcal/capita/day),kcal/capita/day,3.00,4.00,3.00,1.00,1.00
60941,181,Zimbabwe,2899,Miscellaneous,674,Protein supply quantity (g/capita/day),g/capita/day,0.10,0.11,0.08,0.04,0.04
60942,181,Zimbabwe,2899,Miscellaneous,684,Fat supply quantity (g/capita/day),g/capita/day,0.04,0.05,0.03,0.02,0.01

In [4]:
data.isnull().sum()

Area Code          0
Area               0
Item Code          0
Item               0
Element Code       0
Element            0
Unit               0
Y2014           1589
Y2015           1548
Y2016           1535
Y2017           1506
Y2018           1436
dtype: int64

#### 1. Perform a groupby operation on ‘Element’.  What year has the highest sum of Stock Variation?

data.groupby([data['Element']=='Stock Variation']).sum()

#### 2. What is the total Protein supply quantity in Madagascar in 2015?

In [5]:
data[(data['Area'] == 'Madagascar') & (data['Element'] == 'Protein supply quantity (g/capita/day)')]['Y2015'].sum()

173.04999999999998

#### 3. How would you check for the number of rows and columns in a pandas DataFrame named df?

In [6]:
data.shape

(60943, 12)

#### 4. Perform a groupby operation on ‘Element’.  What is the total number of the sum of Processing in 2017?

In [7]:
data[data['Element'] == 'Processing'].groupby('Element')['Y2017'].sum()

Element
Processing    292836.0
Name: Y2017, dtype: float64

#### 5. What is the total number and percentage of missing data in 2014 to 3 decimal places?

In [8]:
missing_count = data['Y2014'].isnull().sum()

total_count = len(data)
percentage_missing = (missing_count / total_count) * 100

# Round the percentage to 3 decimal places
percentage_missing = round(percentage_missing, 3)

print(f"Total missing values in Y2014: {missing_count}")
print(f"Percentage of missing values in Y2014: {percentage_missing}%")

Total missing values in Y2014: 1589
Percentage of missing values in Y2014: 2.607%

#### 6. Select columns ‘Y2017’ and ‘Area’, Perform a groupby operation on ‘Area’.  Which of these Areas had the highest sum in 2017?

In [9]:
grouped = data[['Y2017', 'Area']].groupby('Area').sum()

highest_sum_area = grouped.idxmax()['Y2017']

print(f"The Area with the highest sum in 2017 is: {highest_sum_area}")

The Area with the highest sum in 2017 is: Nigeria

#### 7. What is the total number of unique countries in the dataset?

In [10]:
data['Area'].nunique()

49

#### 8. Given the following python code, what would the output of the code give?
my_tuppy = (1,2,5,8)

my_tuppy[2] = 6

In [11]:
my_tuppy = (1,2,5,8)

my_tuppy[2] = 6

TypeError: 'tuple' object does not support item assignment

#### 9. What would be the output for?

S = [['him', 'sell'], [90, 28, 43]]

S[0][1][1]

In [12]:
S = [['him', 'sell'], [90, 28, 43]]

S[0][1][1]

'e'

#### 10. If you have the following list

lst = [[35, 'Portugal', 94], [33, 'Argentina', 93], [30 , 'Brazil', 92]]

col = [‘Age’,’Nationality’,’Overall’]

How do you create a pandas DataFrame using this list, to look like the table below?

In [13]:
lst = [[35, 'Portugal', 94], [33, 'Argentina', 93], [30 , 'Brazil', 92]]

col = ['Age','Nationality','Overall']

pd.DataFrame(lst, columns=col, index=[i for i in range(1, 4)])

   Age Nationality  Overall
1   35    Portugal       94
2   33   Argentina       93
3   30      Brazil       92

#### 11. Select columns ‘Y2017’ and ‘Area’, Perform a groupby operation on ‘Area’.  Which of these Areas had the 7th lowest sum in 2017?

In [14]:
grouped = data[['Y2017', 'Area']].groupby('Area').sum()

sorted_grouped = grouped.sort_values(by='Y2017').reset_index()

seventh_lowest_area = sorted_grouped.iloc[6]['Area']

print(f"The Area with the 7th lowest sum in 2017 is: {seventh_lowest_area}")

The Area with the 7th lowest sum in 2017 is: Guinea-Bissau

#### 12. What is the mean and standard deviation across the whole dataset for the year 2017 to 2 decimal places?

In [15]:
mean_2017 = data['Y2017'].mean()
std_dev_2017 = data['Y2017'].std()
print(f"The mean for the year 2017 is: {mean_2017}")
print(f"The standard deviation for the year 2017 is: {std_dev_2017}")

The mean for the year 2017 is: 140.9177648602722
The standard deviation for the year 2017 is: 1671.8623590567995

#### 13. Answer the following questions based on the African food production dataset provided by the FAO website already provided

- What is the total sum of Wine produced in 2015 and 2018 respectively?

##### Hint:

- Perform a groupby sum aggregation on ‘Item’

In [16]:
grouped = data[['Item', 'Y2015', 'Y2018']].groupby('Item')[['Y2015', 'Y2018']].sum()

wine_2015 = grouped.loc['Wine', 'Y2015']
wine_2018 = grouped.loc['Wine', 'Y2018']

print(f"Total Wine produced in 2015: {wine_2015}")
print(f"Total Wine produced in 2018: {wine_2018}")

Total Wine produced in 2015: 4251.81
Total Wine produced in 2018: 4039.32

#### 14. Which year had the least correlation with ‘Element Code’?

In [17]:
data[['Element Code', 'Y2014', 'Y2015', 'Y2016', 'Y2017', 'Y2018']].corr()

              Element Code     Y2014     Y2015     Y2016     Y2017     Y2018
Element Code      1.000000  0.024457  0.023889  0.023444  0.024254  0.024279
Y2014             0.024457  1.000000  0.994647  0.996081  0.995230  0.994872
Y2015             0.023889  0.994647  1.000000  0.995739  0.988048  0.988208
Y2016             0.023444  0.996081  0.995739  1.000000  0.992785  0.992757
Y2017             0.024254  0.995230  0.988048  0.992785  1.000000  0.998103
Y2018             0.024279  0.994872  0.988208  0.992757  0.998103  1.000000

#### 15. Which of the following dataframe methods can be used to access elements across rows and columns?
##### Answer : df.iloc[ : ]

#### 16. Which of the following is a python inbuilt module?
##### Answer : Math

#### 17. Consider the following list of tuples:

y = [(2, 4), (7, 8), (1, 5, 9)]

How would you assign element 8 from the list to a variable x?

y = [(2, 4), (7, 8), (1, 5, 9)]

x = y[1][1]

print(x)

#### 18. Which of these python data structures is unorderly?
##### Answer : Set

#### 19. Given the following numpy array 

array  = ([[94, 89, 63],

             [93, 92, 48],

             [92, 94, 56]])

How would you select  the elements in bold and italics from the array?

In [18]:
array = np.array([[94, 89, 63],
                  [93, 92, 48],
                  [92, 94, 56]])

selected_elements = array[:2, 1:]

print(selected_elements)

[[89 63]
 [92 48]]

#### 20. A pandas Dataframe with dimensions (100,3) has how many features and observations?
##### Answer : 3 features, 100 observations